module.exports = {
    trailingComma: 'all', // Расставлять запятые после последнего элемента в объектах и массивах
    tabWidth: 4, // Ширина табуляции
    semi: true, // Расставлять точки с запятой в конце выражений
    singleQuote: true, // Использовать одинарные кавычки вместо двойных
    bracketSpacing: true, // Расставлять пробелы вокруг скобок в объектах
    jsxSingleQuote: false, // Использовать двойные кавычки для ов
    jsxBracketSameLine: false, // Расставлять скобки JSX на отдельной строке
    arrowParens: 'always', // Всегда оборачивать параметры стрелочной функции в скобки
};
